package lab2;
import java.util.Scanner;

/*
3. Даны два действительных числа.
Необходимо получить их сумму, разность и произведение.
Результат вывести на консоль.
*/

public class za3 {
    public static void main(String args[]) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите a: ");
        int a = scanner.nextInt();
        System.out.print("Введите b: ");
        int b = scanner.nextInt();

    }
}
